Terraform plan for __dev__
<details>
  <summary>Plan: 1 to add, 0 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.gke.google_container_node_pool.gke_cluster-nodepool must be replaced
-/+ resource "google_container_node_pool" "gke_cluster-nodepool" {
      ~ id                  = "*************************************************************************************************************" -> (known after apply)
      ~ initial_node_count  = 1 -> (known after apply)
      ~ instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/ebo-dev-321910/zones/asia-south1-b/instanceGroupManagers/gke-ebo-dev-gke-clus-ebo-dev-321910-n-ad672e90-grp",
          - "https://www.googleapis.com/compute/v1/projects/ebo-dev-321910/zones/asia-south1-c/instanceGroupManagers/gke-ebo-dev-gke-clus-ebo-dev-321910-n-69f0d9f4-grp",
          - "https://www.googleapis.com/compute/v1/projects/ebo-dev-321910/zones/asia-south1-a/instanceGroupManagers/gke-ebo-dev-gke-clus-ebo-dev-321910-n-46dee218-grp",
        ] -> (known after apply)
        name                = "ebo-dev-321910-node-pool"
      + name_prefix         = (known after apply)
      ~ node_locations      = [
          - "asia-south1-a",
          - "asia-south1-b",
          - "asia-south1-c",
        ] -> (known after apply)
      + operation           = (known after apply)
      ~ version             = "1.20.9-gke.700" -> (known after apply)
        # (5 unchanged attributes hidden)



      ~ node_config {
          ~ disk_type         = "pd-standard" -> (known after apply)
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS_CONTAINERD" -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ machine_type      = "n1-standard-2" -> "e2-standard-2" # forces replacement
          ~ metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> (known after apply)
          ~ service_account   = "default" -> (known after apply)
            tags              = [
                "dev",
            ]
          ~ taint             = [] -> (known after apply)
            # (4 unchanged attributes hidden)

          ~ shielded_instance_config {
              ~ enable_integrity_monitoring = true -> (known after apply)
              ~ enable_secure_boot          = false -> (known after apply)
            }

            # (1 unchanged block hidden)
        }

      ~ upgrade_settings {
          ~ max_surge       = 1 -> (known after apply)
          ~ max_unavailable = 0 -> (known after apply)
        }
        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 4, in module "jumpbox":
   4:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

Plan generated in [Terraform #49](https://github.com/ebomart/commerce-infrastructure/actions/runs/1193001287)